hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static bool hardReset() {
    gpio_set_direction(static_cast<gpio_num_t>(g_rst), GPIO_MODE_OUTPUT);
    gpio_set_level(static_cast<gpio_num_t>(g_rst), 0);
    slac_delay(slac::hardreset_low_ms());
    gpio_set_level(static_cast<gpio_num_t>(g_rst), 1);
    slac_delay(slac::hardreset_high_ms());
    // Wait before probing the modem (datasheet recommends 200–500 ms)
    slac_delay(QCA7000_POST_RESET_DELAY_MS);

    auto slowRd16 = [&](uint16_t reg, uint16_t* out) -> esp_err_t {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        esp_err_t err = spiTransfer16(cmd16(true, true, reg), hz, nullptr);
        if (err == ESP_OK)
            err = spiTransfer16(0, hz, out);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        return err;
    };

    uint16_t dummy;
    if (slowRd16(SPI_REG_SIGNATURE, &dummy) != ESP_OK)
        return false; // dummy read as recommended

    uint32_t t0 = slac_millis();
    uint16_t sig = 0, buf = 0;
    do {
        if (slowRd16(SPI_REG_SIGNATURE, &sig) != ESP_OK ||
            slowRd16(SPI_REG_WRBUF_SPC_AVA, &buf) != ESP_OK)
            return false;
        if (sig == SIG && buf == WRBUF_RST)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < QCA7000_RESET_TIMEOUT_MS);

    if (sig != SIG || buf != WRBUF_RST) {
        ESP_LOGE(PLC_TAG, "Reset probe failed (SIG=0x%04X BUF=0x%04X)", sig, buf);
        return false;
    }
    ESP_LOGI(PLC_TAG, "Reset probe OK (SIG=0x%04X)", sig);

    t0 = slac_millis();
    uint16_t cause = 0;
    while (true) {
        if (slowRd16(SPI_REG_INTR_CAUSE, &cause) != ESP_OK)
            return false;
        if (cause & SPI_INT_CPU_ON)
            break;
        if (slac_millis() - t0 >= slac::cpuon_timeout_ms())
            break;
    }
    if (!(cause & SPI_INT_CPU_ON)) {
        ESP_LOGE(PLC_TAG, "CPU_ON not asserted after hard reset");
        return false;
    }

    uint16_t cfg = 0;
    if (slowRd16(SPI_REG_SPI_CONFIG, &cfg) != ESP_OK)
        return false;
    if (cfg & QCASPI_MULTI_CS_BIT)
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);

    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    // Read signature twice before enabling interrupts as recommended by
    // the datasheet to ensure the modem is ready to accept new commands.
    slowRd16(SPI_REG_SIGNATURE, &dummy);
    slowRd16(SPI_REG_SIGNATURE, &dummy);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    return true;
}

static bool softReset() {
    auto slowRd16 = [&](uint16_t reg, uint16_t* out) -> esp_err_t {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        esp_err_t err = spiTransfer16(cmd16(true, true, reg), hz, nullptr);
        if (err == ESP_OK)
            err = spiTransfer16(0, hz, out);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        return err;
    };
    auto slowWr16 = [&](uint16_t reg, uint16_t val) -> esp_err_t {
        spiBegin();
        int hz = slac::spi_slow_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        esp_err_t err = spiTransfer16(cmd16(false, true, reg), hz, nullptr);
        if (err == ESP_OK)
            err = spiTransfer16(val, hz, nullptr);
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();
        return err;
    };

    uint16_t cfg = 0;
    if (slowRd16(SPI_REG_SPI_CONFIG, &cfg) != ESP_OK)
        return false;
    if (slowWr16(SPI_REG_SPI_CONFIG, cfg | QCASPI_SLAVE_RESET_BIT) != ESP_OK)
        return false;
    slac_delay(10);

    uint16_t dummy;
    slowRd16(SPI_REG_SIGNATURE, &dummy); // dummy read

    uint32_t t0 = slac_millis();
    uint16_t sig = 0, buf = 0;
    do {
        if (slowRd16(SPI_REG_SIGNATURE, &sig) != ESP_OK ||
            slowRd16(SPI_REG_WRBUF_SPC_AVA, &buf) != ESP_OK)
            return false;
        if (sig == SIG && buf == WRBUF_RST)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < QCA7000_RESET_TIMEOUT_MS);

    if (sig != SIG || buf != WRBUF_RST)
        return false;

    t0 = slac_millis();
    uint16_t cause = 0;
    while (true) {
        if (slowRd16(SPI_REG_INTR_CAUSE, &cause) != ESP_OK)
            return false;
        if (cause & SPI_INT_CPU_ON)
            break;
        if (slac_millis() - t0 >= slac::cpuon_timeout_ms())
            break;
    }
    if (!(cause & SPI_INT_CPU_ON)) {
        ESP_LOGE(PLC_TAG, "CPU_ON not asserted after soft reset");
        return false;
    }
    if (slowRd16(SPI_REG_SPI_CONFIG, &cfg) != ESP_OK)
        return false;
    if (cfg & QCASPI_MULTI_CS_BIT)
        slowWr16(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);

    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    return true;
}

static void initialSetup() {
    uint16_t dummy;
    spiRd16_slow(SPI_REG_SIGNATURE, &dummy);
    uint32_t t0 = slac_millis();
    uint16_t sig = 0;
    do {
        if (spiRd16_slow(SPI_REG_SIGNATURE, &sig) != ESP_OK)
            return;
        if (sig == SIG)
            break;
        slac_delay(5);
    } while (slac_millis() - t0 < QCA7000_RESET_TIMEOUT_MS);
    uint16_t cfg = 0;
    if (spiRd16_slow(SPI_REG_SPI_CONFIG, &cfg) != ESP_OK)
        return;
    if (cfg & QCASPI_MULTI_CS_BIT)
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);
    spiWr16_slow(SPI_REG_INTR_CAUSE, 0xFFFF);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
}

esp_err_t qca7000ReadInternalReg(uint16_t r, uint16_t* out) {
    return spiRd16_slow(r, out);
}
bool qca7000ReadSignature(uint16_t* s, uint16_t* v) {
    uint16_t sig = 0, ver = 0;
    if (qca7000ReadInternalReg(SPI_REG_SIGNATURE, &sig) != ESP_OK ||
        qca7000ReadInternalReg(0x1B00, &ver) != ESP_OK)
        return false;
    if (s)
        *s = sig;
    if (v)
        *v = ver;
    return sig == SIG;
}

bool qca7000CheckAlive() {
    uint16_t sig = 0, cause = 0, dummy = 0;
    qca7000ReadInternalReg(SPI_REG_SIGNATURE, &sig);
    qca7000ReadInternalReg(SPI_REG_WRBUF_SPC_AVA, &dummy);
    qca7000ReadInternalReg(SPI_REG_INTR_CAUSE, &cause);
    return sig == SIG && (cause & SPI_INT_CPU_ON);
}

