hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static bool read_region_code(qca7000_region* region) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::qualcomm::op_attr_req req;
    } req_msg{};

    memset(&req_msg, 0, sizeof(req_msg));
    memset(req_msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(req_msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    req_msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    req_msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    req_msg.hp.mmtype =
        slac::htole16(slac::defs::qualcomm::MMTYPE_OP_ATTR |
                      slac::defs::MMTYPE_MODE_REQ);

    if (txFrame(reinterpret_cast<uint8_t*>(&req_msg), sizeof(req_msg)) != ESP_OK)
        return false;

    uint32_t start = slac_millis();
    uint8_t buf[V2GTP_BUFFER_SIZE];
    while (slac_millis() - start < 100) {
        qca7000ProcessSlice(1000);
        size_t got = spiQCA7000checkForReceivedData(buf, sizeof(buf));
        if (!got)
            continue;
        if (got < sizeof(ether_header) + 3)
            continue;
        const ether_header* eth = reinterpret_cast<const ether_header*>(buf);
        if (eth->ether_type != slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY))
            continue;
        const uint8_t* p = buf + sizeof(ether_header);
        uint8_t mmv = p[0];
        uint16_t mmtype = slac::le16toh(*reinterpret_cast<const uint16_t*>(p + 1));
        if (mmv != static_cast<uint8_t>(slac::defs::MMV::AV_1_0))
            continue;
        if (mmtype == (slac::defs::qualcomm::MMTYPE_OP_ATTR |
                        slac::defs::MMTYPE_MODE_CNF)) {
            const auto* cnf =
                reinterpret_cast<const slac::messages::qualcomm::op_attr_cnf*>(p + 3);
            if (cnf->success == 0) {
                *region = (cnf->line_freq_zc == 0x01) ? qca7000_region::NA
                                                     : qca7000_region::EU;
                return true;
            }
        }
    }
    return false;
}

#ifdef LIBSLAC_TESTING
esp_err_t txFrame(const uint8_t* eth, size_t ethLen) {
#else
static esp_err_t txFrame(const uint8_t* eth, size_t ethLen) {
#endif
    if (ethLen > 1522)
        return ESP_FAIL;
    size_t frameLen = ethLen;
    if (frameLen < 60)
        frameLen = 60;
    uint16_t spiLen = TX_HDR + frameLen + FTR_LEN;
    uint16_t avail = 0;
    if (spiRd16_slow(SPI_REG_WRBUF_SPC_AVA, &avail) != ESP_OK || avail < spiLen)
        return ESP_FAIL;

    if (spiWr16_slow(SPI_REG_BFR_SIZE, spiLen) != ESP_OK)
        return ESP_FAIL;

    spiBegin();
    int hz = slac::spi_fast_hz();
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
    esp_err_t err = ESP_OK;
    if (err == ESP_OK)
        err = spiTransfer16(cmd16(false, false, 0), hz, nullptr);
    if (err == ESP_OK)
        err = spiTransfer16(SOF_WORD, hz, nullptr);
    if (err == ESP_OK)
        err = spiTransfer16(SOF_WORD, hz, nullptr);
    if (err == ESP_OK)
        err = spiTransfer16(slac::htole16(static_cast<uint16_t>(frameLen)), hz, nullptr);
    if (err == ESP_OK)
        err = spiTransfer16(0, hz, nullptr);
    if (err == ESP_OK && ethLen) {
        size_t off = 0;
        while (off < ethLen && err == ESP_OK) {
            size_t chunk = ethLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            err = spiWriteBytes(eth + off, chunk, hz);
            off += chunk;
        }
    }
    if (err == ESP_OK && frameLen > ethLen) {
        uint8_t pad[60]{};
        size_t padLen = frameLen - ethLen;
        size_t off = 0;
        while (off < padLen && err == ESP_OK) {
            size_t chunk = padLen - off;
            if (chunk > slac::spi_burst_len())
                chunk = slac::spi_burst_len();
            err = spiWriteBytes(pad, chunk, hz);
            off += chunk;
        }
    }
    if (err == ESP_OK)
        err = spiTransfer16(EOF_WORD, hz, nullptr);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    spiEnd();
    return err;
}

static void handleRxError(const char* reason) {
    ESP_LOGW(PLC_TAG, "RX error: %s - resetting", reason);
    spiWr16_slow(SPI_REG_INTR_ENABLE, 0);
    bool ok = qca7000SoftReset();
    uint16_t cfg = 0;
    spiRd16_slow(SPI_REG_SPI_CONFIG, &cfg);
    if (cfg & QCASPI_MULTI_CS_BIT) {
        ESP_LOGW(PLC_TAG, "Clearing MULTI_CS bit after reset");
        spiWr16_slow(SPI_REG_SPI_CONFIG, cfg & ~QCASPI_MULTI_CS_BIT);
    }
    if (!ok) {
        ESP_LOGW(PLC_TAG, "Soft reset failed - performing hard reset");
        ok = hardReset();
    }
    if (!ok) {
        ESP_LOGE(PLC_TAG, "Hard reset failed");
        g_driver_fatal = true;
        if (g_err_cb.flag)
            *g_err_cb.flag = true;
        if (g_err_cb.cb)
            g_err_cb.cb(Qca7000ErrorStatus::DriverFatal, g_err_cb.arg);
        return;
    }
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
    if (g_err_cb.cb)
        g_err_cb.cb(Qca7000ErrorStatus::Reset, g_err_cb.arg);
}
#ifdef LIBSLAC_TESTING
esp_err_t fetchRx() {
#else
static esp_err_t fetchRx() {
#endif
    while (true) {
        uint16_t avail = 0;
        if (spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA, &avail) != ESP_OK)
            return ESP_FAIL;
        if (avail < RX_HDR + FTR_LEN || avail > V2GTP_BUFFER_SIZE)
            break;

        uint16_t requested = avail;
        if (spiWr16_slow(SPI_REG_BFR_SIZE, requested) != ESP_OK)
            return ESP_FAIL;

        static uint8_t buf[V2GTP_BUFFER_SIZE];
        spiBegin();
        int hz = slac::spi_fast_hz();
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 0);
        uint16_t first = 0;
        if (spiTransfer16(cmd16(true, false, 0), hz, &first) != ESP_OK) {
            gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
            spiEnd();
            return ESP_FAIL;
        }
        buf[0] = first & 0xFF;
        buf[1] = first >> 8;
        for (uint16_t i = 0; i < requested - 2; ++i) {
            uint8_t b = 0;
            if (spiTransfer(0, hz, &b) != ESP_OK) {
                gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
                spiEnd();
                return ESP_FAIL;
            }
            buf[i + 2] = b;
        }
        gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
        spiEnd();

        const uint8_t* p = buf;
        uint16_t remaining = requested;
        while (remaining >= RX_HDR + FTR_LEN) {
            uint32_t len = (uint32_t)p[0] | ((uint32_t)p[1] << 8) |
                            ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
            if (memcmp(p + 4, "\xAA\xAA\xAA\xAA", 4) != 0) {
                handleRxError("bad SOF");
                remaining = 0;
                break;
            }

