hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
            uint16_t fl = slac::le16toh(static_cast<uint16_t>((p[9] << 8) | p[8]));
            uint16_t frame_total = RX_HDR + fl + FTR_LEN;
            if (len != frame_total && len + 4 != frame_total) {
                ESP_LOGE(PLC_TAG,
                         "RX len mismatch: req=%" PRIu32 " got=%" PRIu32,
                         static_cast<uint32_t>(frame_total), len);
                handleRxError("length mismatch");
                remaining = 0;
                break;
            }

            if (frame_total > remaining) {
                handleRxError("invalid FL");
                remaining = 0;
                break;
            }
            if (p[RX_HDR + fl] != 0x55 || p[RX_HDR + fl + 1] != 0x55) {
                handleRxError("bad EOF");
                remaining = 0;
                break;
            }

            ringPush(p + RX_HDR, fl);

            p += frame_total;
            remaining -= frame_total;
        }
    }
    return ESP_OK;
}

bool spiQCA7000SendEthFrame(const uint8_t* f, size_t l) {
    esp_err_t err = txFrame(f, l);
    if (err == ESP_OK && l <= V2GTP_BUFFER_SIZE) {
        memcpy(myethtransmitbuffer, f, l);
        myethtransmitlen = l;
    }
    return err == ESP_OK;
}
size_t spiQCA7000checkForReceivedData(uint8_t* d, size_t m) {
    if (fetchRx() != ESP_OK)
        return 0;
    const uint8_t* s;
    size_t l;
    if (!ringPop(&s, &l))
        return 0;
    size_t c = l > m ? m : l;
    memcpy(d, s, c);
    size_t store = l;
    if (l > V2GTP_BUFFER_SIZE) {
        ESP_LOGW(PLC_TAG, "RX frame larger than buffer (%zu > %d) - truncating", l, V2GTP_BUFFER_SIZE);
        store = V2GTP_BUFFER_SIZE;
    }
    memcpy(myethreceivebuffer, s, store);
    myethreceivelen = store;
    return c;
}

static uint8_t g_src_mac[ETH_ALEN] = {0x02, 0x00, 0x00, 0x00, 0x00, 0x01};

void qca7000SetMac(const uint8_t mac[ETH_ALEN]) {
    if (mac)
        memcpy(g_src_mac, mac, ETH_ALEN);
}

const uint8_t* qca7000GetMac() {
    return g_src_mac;
}

const uint8_t* qca7000GetMatchedMac() {
    return g_slac_ctx.matched_mac;
}

qca7000_region qca7000GetRegion() {
    return g_region;
}

static bool send_cm_set_key_req_local(const uint8_t nmk[slac::defs::NMK_LEN],
                                      const uint8_t nid[slac::defs::NID_LEN]) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_set_key_req req;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memset(msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype =
        slac::htole16(slac::defs::MMTYPE_CM_SET_KEY | slac::defs::MMTYPE_MODE_REQ);
    msg.req.key_type = slac::defs::CM_SET_KEY_REQ_KEY_TYPE_NMK;
    msg.req.my_nonce = 0;
    msg.req.your_nonce = 0;
    msg.req.pid = slac::defs::CM_SET_KEY_REQ_PID_HLE;
    msg.req.prn = slac::htole16(slac::defs::CM_SET_KEY_REQ_PRN_UNUSED);
    msg.req.pmn = slac::defs::CM_SET_KEY_REQ_PMN_UNUSED;
    msg.req.cco_capability = slac::defs::CM_SET_KEY_REQ_CCO_CAP_NONE;
    memcpy(msg.req.nid, nid, sizeof(msg.req.nid));
    msg.req.new_eks = slac::defs::CM_SET_KEY_REQ_PEKS_NMK_KNOWN_TO_STA;
    memcpy(msg.req.new_key, nmk, slac::defs::NMK_LEN);

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_start_atten_char(const SlacContext& ctx);
static bool send_mnbc_sound(const SlacContext& ctx, uint8_t remaining);
static bool send_atten_char_rsp(const SlacContext& ctx, const uint8_t* dst,
                                const slac::messages::cm_atten_char_ind* ind);
static bool send_set_key_cnf(const SlacContext& ctx, const uint8_t* dst, const slac::messages::cm_set_key_req* req);
static bool send_parm_req(const SlacContext& ctx);
static bool send_parm_cnf(const SlacContext& ctx, const uint8_t* dst,
                          const slac::messages::cm_slac_parm_req& req);
static bool send_parm_cnf(const SlacContext& ctx, const uint8_t* dst,
                          const slac::messages::cm_slac_parm_req& req);

static bool send_parm_req(const SlacContext& ctx) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_slac_parm_req req;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memset(msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_SLAC_PARAM | slac::defs::MMTYPE_MODE_REQ);
    if (g_region == qca7000_region::NA)
        msg.req.application_type = 0x01;
    else
        msg.req.application_type = 0x00;
    msg.req.security_type = slac::defs::COMMON_SECURITY_TYPE;
    memcpy(msg.req.run_id, ctx.run_id, sizeof(ctx.run_id));

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_parm_cnf(const SlacContext& ctx, const uint8_t* dst,
                          const slac::messages::cm_slac_parm_req& req) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_slac_parm_cnf cnf;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memcpy(msg.eth.ether_dhost, dst, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype =
        slac::htole16(slac::defs::MMTYPE_CM_SLAC_PARAM | slac::defs::MMTYPE_MODE_CNF);
    memset(msg.cnf.m_sound_target, 0xFF, sizeof(msg.cnf.m_sound_target));
    msg.cnf.num_sounds = slac::defs::CM_SLAC_PARM_CNF_NUM_SOUNDS;
    msg.cnf.timeout = slac::defs::CM_SLAC_PARM_CNF_TIMEOUT;
    msg.cnf.resp_type = slac::defs::CM_SLAC_PARM_CNF_RESP_TYPE;
    memcpy(msg.cnf.forwarding_sta, qca7000GetMac(), ETH_ALEN);
    msg.cnf.application_type = req.application_type;
    msg.cnf.security_type = req.security_type;
    memcpy(msg.cnf.run_id, ctx.run_id, sizeof(ctx.run_id));

    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_start_atten_char(const SlacContext& ctx) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_start_atten_char_ind ind;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memset(msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_START_ATTEN_CHAR | slac::defs::MMTYPE_MODE_IND);
    msg.ind.application_type = slac::defs::COMMON_APPLICATION_TYPE;
    msg.ind.security_type = slac::defs::COMMON_SECURITY_TYPE;
    msg.ind.num_sounds = slac::defs::C_EV_MATCH_MNBC;
    msg.ind.timeout = slac::defs::TT_EVSE_MATCH_MNBC_MS / 100;
    msg.ind.resp_type = slac::defs::CM_SLAC_PARM_CNF_RESP_TYPE;
    memcpy(msg.ind.forwarding_sta, qca7000GetMac(), ETH_ALEN);
    memcpy(msg.ind.run_id, ctx.run_id, sizeof(ctx.run_id));
    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

static bool send_mnbc_sound(const SlacContext& ctx, uint8_t remaining) {
    struct __attribute__((packed)) {
        ether_header eth;
        struct {
            uint8_t mmv;
            uint16_t mmtype;
        } hp;
        slac::messages::cm_mnbc_sound_ind ind;
    } msg{};

    memset(&msg, 0, sizeof(msg));
    memset(msg.eth.ether_dhost, 0xFF, ETH_ALEN);
    memcpy(msg.eth.ether_shost, qca7000GetMac(), ETH_ALEN);
    msg.eth.ether_type = slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY);
    msg.hp.mmv = static_cast<uint8_t>(slac::defs::MMV::AV_1_0);
    msg.hp.mmtype = slac::htole16(slac::defs::MMTYPE_CM_MNBC_SOUND | slac::defs::MMTYPE_MODE_IND);
    msg.ind.application_type = slac::defs::COMMON_APPLICATION_TYPE;
    msg.ind.security_type = slac::defs::COMMON_SECURITY_TYPE;
    memset(msg.ind.sender_id, 0, sizeof(msg.ind.sender_id));
    msg.ind.remaining_sound_count = remaining;
    memcpy(msg.ind.run_id, ctx.run_id, sizeof(ctx.run_id));
    for (uint8_t& b : msg.ind.random)
        b = static_cast<uint8_t>(esp_random() & 0xFF);
    return txFrame(reinterpret_cast<uint8_t*>(&msg), sizeof(msg)) == ESP_OK;
}

