hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
    bool ok = send_parm_req(g_slac_ctx);
    if (ok)
        g_fsm.reset<WaitParmCnfState>(g_slac_ctx);
    else
        g_fsm.reset<IdleState>(g_slac_ctx);
    return ok;
}

// Poll for SLAC confirmation frames and update state accordingly.
SlacState qca7000getSlacResult() {
    const SlacState prev_result = g_slac_ctx.result;
    if (fetchRx() != ESP_OK)
        return g_slac_ctx.result;
    const uint32_t now = slac_millis();
    if (g_slac_ctx.result == SlacState::WaitParmCnf &&
        now - g_slac_ctx.timer > slac::defs::TT_EVSE_SLAC_INIT_MS)
        g_fsm.handle_event(slac::SlacEvent::Timeout);
    const uint8_t* d;
    size_t l;
    while (ringPop(&d, &l)) {
        if (l < sizeof(ether_header) + 3)
            continue;
        const ether_header* eth = reinterpret_cast<const ether_header*>(d);
        if (eth->ether_type != slac::htons(slac::defs::ETH_P_HOMEPLUG_GREENPHY))
            continue;
        if (g_slac_ctx.filter_active &&
            memcmp(eth->ether_shost, g_slac_ctx.matched_mac, ETH_ALEN) != 0)
            continue;
        const uint8_t* p = d + sizeof(ether_header);
        uint8_t mmv = p[0];
        uint16_t mmtype = slac::le16toh(*reinterpret_cast<const uint16_t*>(p + 1));
        if (mmv != static_cast<uint8_t>(slac::defs::MMV::AV_1_0))
            continue;

        if (mmtype == (slac::defs::MMTYPE_CM_SLAC_PARAM | slac::defs::MMTYPE_MODE_CNF)) {
            const auto* cnf = reinterpret_cast<const slac::messages::cm_slac_parm_cnf*>(p + 3);
            if (!memcmp(cnf->run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id))) {
                g_fsm.handle_event(slac::SlacEvent::GotParmCnf);
            } else {
                g_fsm.handle_event(slac::SlacEvent::Error);
            }
        } else if (mmtype == (slac::defs::MMTYPE_CM_ATTEN_PROFILE | slac::defs::MMTYPE_MODE_IND)) {
            if (memcmp(eth->ether_shost, g_slac_ctx.pev_mac, ETH_ALEN) != 0)
                continue;
            const auto* prof = reinterpret_cast<const slac::messages::cm_atten_profile_ind*>(p + 3);
            if (memcmp(prof->pev_mac, g_slac_ctx.pev_mac, ETH_ALEN) != 0)
                continue;
            uint8_t num_groups = prof->num_groups;
            if (num_groups != slac::defs::AAG_LIST_LEN) {
                ESP_LOGW(PLC_TAG,
                         "ATTEN_PROFILE num_groups %u != %u, clamping",
                         static_cast<unsigned>(num_groups),
                         static_cast<unsigned>(slac::defs::AAG_LIST_LEN));
                num_groups = slac::defs::AAG_LIST_LEN;
            }
            if (g_slac_ctx.atten_count == 0) {
                memset(g_slac_ctx.atten_sum, 0, sizeof(g_slac_ctx.atten_sum));
                g_slac_ctx.num_groups = num_groups;
                g_slac_ctx.timer = slac_millis();
            }
            for (uint8_t i = 0; i < num_groups; ++i) {
                g_slac_ctx.atten_sum[i] += prof->aag[i];
            }
            ++g_slac_ctx.atten_count;
            uint32_t tnow = slac_millis();
            if (tnow - g_slac_ctx.timer >= slac::defs::TT_EVSE_MATCH_MNBC_MS ||
                g_slac_ctx.atten_count >= slac::defs::C_EV_MATCH_MNBC) {
                send_atten_char_ind(g_slac_ctx);
                g_slac_ctx.atten_count = 0;
                g_slac_ctx.timer = 0;
            }
        } else if (mmtype == (slac::defs::MMTYPE_CM_MNBC_SOUND | slac::defs::MMTYPE_MODE_IND)) {
            if (memcmp(eth->ether_shost, g_slac_ctx.pev_mac, ETH_ALEN) != 0)
                continue;
            if (g_slac_ctx.atten_count == 0)
                g_slac_ctx.timer = slac_millis();
        } else if (mmtype == (slac::defs::MMTYPE_CM_ATTEN_CHAR | slac::defs::MMTYPE_MODE_IND)) {
            const auto* ind = reinterpret_cast<const slac::messages::cm_atten_char_ind*>(p + 3);
            if (!memcmp(ind->run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id))) {
                send_atten_char_rsp(g_slac_ctx, eth->ether_shost, ind);
                g_fsm.handle_event(slac::SlacEvent::GotAttenCharInd);
            } else {
                g_fsm.handle_event(slac::SlacEvent::Error);
            }
        } else if (mmtype == (slac::defs::MMTYPE_CM_SET_KEY | slac::defs::MMTYPE_MODE_REQ)) {
            const auto* req = reinterpret_cast<const slac::messages::cm_set_key_req*>(p + 3);
            send_set_key_cnf(g_slac_ctx, eth->ether_shost, req);
            g_fsm.handle_event(slac::SlacEvent::GotSetKeyReq);
        } else if (mmtype == (slac::defs::MMTYPE_CM_VALIDATE | slac::defs::MMTYPE_MODE_REQ)) {
            const auto* req = reinterpret_cast<const slac::messages::cm_validate_req*>(p + 3);
            send_validate_cnf(eth->ether_shost, req);
            if (req->result == slac::defs::CM_VALIDATE_REQ_RESULT_FAILURE) {
                clear_slac_state();
                g_fsm.handle_event(slac::SlacEvent::ValidateFailed);
            } else {
                g_fsm.handle_event(slac::SlacEvent::GotValidateReq);
            }
        } else if (mmtype == (slac::defs::MMTYPE_CM_SLAC_MATCH | slac::defs::MMTYPE_MODE_REQ)) {
            const auto* req = reinterpret_cast<const slac::messages::cm_slac_match_req*>(p + 3);
            if (!memcmp(req->run_id, g_slac_ctx.run_id, sizeof(g_slac_ctx.run_id))) {
                memcpy(&g_slac_ctx.match_req, req, sizeof(g_slac_ctx.match_req));
                memcpy(g_slac_ctx.match_src_mac, eth->ether_shost, ETH_ALEN);
                g_fsm.handle_event(slac::SlacEvent::GotMatchReq);
            } else {
                g_fsm.handle_event(slac::SlacEvent::Error);
            }
        }
    }

    if (g_slac_ctx.result == SlacState::Sounding) {
        if (g_slac_ctx.sound_sent < slac::defs::C_EV_MATCH_MNBC &&
            now - g_slac_ctx.timer >= slac::defs::TP_EV_BATCH_MSG_INTERVAL_MS) {
            g_fsm.handle_event(slac::SlacEvent::SoundIntervalElapsed);
            g_slac_ctx.timer = now;
            if (g_slac_ctx.sound_sent == slac::defs::C_EV_MATCH_MNBC)
                g_slac_ctx.timer = now; // start wait for ATTEN_CHAR
        }
        if (g_slac_ctx.atten_count > 0 &&
            now - g_slac_ctx.timer > slac::defs::TT_EVSE_MATCH_MNBC_MS) {
            send_atten_char_ind(g_slac_ctx);
            g_slac_ctx.atten_count = 0;
            g_slac_ctx.timer = 0;
        }
        if (g_slac_ctx.sound_sent == slac::defs::C_EV_MATCH_MNBC &&
            now - g_slac_ctx.timer > slac::defs::TT_EV_ATTEN_RESULTS_MS)
            g_fsm.handle_event(slac::SlacEvent::Timeout);
    } else if (g_slac_ctx.result == SlacState::WaitSetKey &&
               now - g_slac_ctx.timer > slac::defs::TT_MATCH_SEQUENCE_MS) {
        g_fsm.handle_event(slac::SlacEvent::Timeout);
    } else if (g_slac_ctx.result == SlacState::WaitValidate &&
               now - g_slac_ctx.timer > slac::defs::TT_MATCH_RESPONSE_MS) {
        g_fsm.handle_event(slac::SlacEvent::Timeout);
    } else if (g_slac_ctx.result == SlacState::WaitMatch &&
               now - g_slac_ctx.timer > slac::defs::TT_MATCH_JOIN_MS) {
        g_fsm.handle_event(slac::SlacEvent::Timeout);
    }

    bool need_reset = false;
    if (qca7000DriverFatal()) {
        need_reset = true;
    } else if (prev_result != SlacState::Idle && prev_result != SlacState::Matched &&
               g_slac_ctx.result == SlacState::Idle) {
        need_reset = true;
    }

    if (need_reset) {
        bool ok = qca7000SoftReset();
        if (!ok)
            ok = qca7000ResetAndCheck();
        if (!ok)
            g_driver_fatal = true;
        if (g_err_cb.flag)
            *g_err_cb.flag = g_driver_fatal || !ok;
        if (g_err_cb.cb)
            g_err_cb.cb(ok ? Qca7000ErrorStatus::Reset : Qca7000ErrorStatus::DriverFatal,
                        g_err_cb.arg);
    }

    return g_slac_ctx.result;
}

static inline uint32_t get_us() { return slac_micros(); }

