hyndex/libslac/examples/platformio_complete/lib/slac_port/esp32s3/qca7000.cpp
static void process_cause(uint16_t cause) {
    uint16_t snapshot_cause = 0, intr_en = 0, wrbuf = 0, rdbuf = 0;
    spiRd16_slow(SPI_REG_INTR_CAUSE, &snapshot_cause);
    spiRd16_slow(SPI_REG_INTR_ENABLE, &intr_en);
    spiRd16_slow(SPI_REG_WRBUF_SPC_AVA, &wrbuf);
    spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA, &rdbuf);
    ESP_LOGW(PLC_TAG,
             "IRQ cause=0x%04X snap=0x%04X en=0x%04X wr=0x%04X rd=0x%04X",
             cause, snapshot_cause, intr_en, wrbuf, rdbuf);
    if (cause & SPI_INT_CPU_ON) {
        initialSetup();
        if (g_err_cb.cb)
            g_err_cb.cb(Qca7000ErrorStatus::Reset, g_err_cb.arg);
    }

    if (cause & (SPI_INT_WRBUF_ERR | SPI_INT_RDBUF_ERR)) {
        bool ok = hardReset();
        if (!ok) {
            ESP_LOGE(PLC_TAG, "Hard reset failed after buffer error");
            if (++g_crash_count >= QCA7000_CRASH_MAX_COUNT && g_pwr >= 0) {
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
                slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
                slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
                g_crash_count = 0;
            }
            g_driver_fatal = true;
        } else {
            g_crash_count = 0;
            qca7000startSlac();
        }
        bool fatal = !ok;
        uint32_t now = slac_millis();
        if (now - g_buferr_ts <= QCA7000_BUFERR_WINDOW_MS)
            ++g_buferr_count;
        else
            g_buferr_count = 1;
        g_buferr_ts = now;
        if (g_buferr_count >= QCA7000_BUFERR_MAX_COUNT) {
            if (g_pwr >= 0) {
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
                slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
                gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
                slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
            }
            g_driver_fatal = true;
            fatal = true;
            g_buferr_count = 0;
        }
        if (g_err_cb.flag)
            *g_err_cb.flag = fatal || g_driver_fatal;
        if (g_err_cb.cb)
            g_err_cb.cb((fatal || g_driver_fatal) ?
                            Qca7000ErrorStatus::DriverFatal :
                            Qca7000ErrorStatus::Reset,
                        g_err_cb.arg);
    }

    if (cause & SPI_INT_PKT_AVLBL) {
        size_t loops = 0;
        uint16_t avail = 0;
        while (spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA, &avail) == ESP_OK && avail > 0) {
            if (fetchRx() != ESP_OK)
                break;
            if (++loops >= slac::spi_burst_len())
                break;
            if (spiRd16_slow(SPI_REG_RDBUF_BYTE_AVA, &avail) != ESP_OK || avail == 0)
                break;
        }
    }

    spiWr16_slow(SPI_REG_INTR_CAUSE, cause);
}

void qca7000ProcessSlice(uint32_t max_us) {
    if (g_sleeping)
        return;
    uint32_t t0 = get_us();
    uint16_t loops = 0;

    spiWr16_slow(SPI_REG_INTR_ENABLE, 0);
    while (true) {
        uint16_t cause = 0;
        if (spiRd16_slow(SPI_REG_INTR_CAUSE, &cause) != ESP_OK || !cause)
            break;

        process_cause(cause);
        if (++loops > QCA7000_PROCESS_MAX_LOOPS)
            break;
        if (get_us() - t0 > max_us)
            break;
    }
    spiWr16_slow(SPI_REG_INTR_ENABLE, INTR_MASK);
}

void qca7000Process() {
    if (g_sleeping)
        return;
    if (qca7000CheckBcbToggle())
        qca7000Wake();
    qca7000ProcessSlice(500);
}

bool qca7000setup(spi_device_handle_t bus,
                  int csPin,
                  int rstPin,
                  int intPin,
                  int pwrPin,
                  bool auto_irq) {
    ESP_LOGI(PLC_TAG,
             "QCA7000 setup: bus=%p CS=%d RST=%d INT=%d PWR=%d",
             bus,
             csPin,
             rstPin,
             intPin,
             pwrPin);
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    g_rx_overflow_count.store(0, std::memory_order_relaxed);
    g_spi = bus;
    g_cs = csPin;
    g_rst = rstPin;
    g_int = intPin;
    g_pwr = pwrPin;
    g_auto_irq = auto_irq;
#ifdef ESP_PLATFORM
    if (g_auto_irq && g_int >= 0) {
        gpio_config_t int_cfg{};
        int_cfg.pin_bit_mask = 1ULL << g_int;
        int_cfg.mode = GPIO_MODE_INPUT;
        int_cfg.pull_up_en = GPIO_PULLUP_ENABLE;
        int_cfg.intr_type = PLC_INT_EDGE;
        gpio_config(&int_cfg);
        gpio_install_isr_service(0);
        gpio_isr_handler_add(static_cast<gpio_num_t>(g_int), qca7000_isr, nullptr);
    }
#endif
#ifdef ESP_PLATFORM
    if (!g_spi_mutex)
        g_spi_mutex = xSemaphoreCreateMutex();
#endif
    gpio_set_direction(static_cast<gpio_num_t>(g_cs), GPIO_MODE_OUTPUT);
    gpio_set_level(static_cast<gpio_num_t>(g_cs), 1);
    if (g_pwr >= 0) {
        gpio_set_direction(static_cast<gpio_num_t>(g_pwr), GPIO_MODE_OUTPUT);
        gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
    }

    for (int attempt = 1; attempt <= static_cast<int>(slac::max_retries()); ++attempt) {
        ESP_LOGI(PLC_TAG, "Setup attempt %d", attempt);
        if (hardReset()) {
            read_region_code(&g_region);
            ESP_LOGI(PLC_TAG, "QCA7000 ready (region %u)", static_cast<unsigned>(g_region));
            return true;
        }
        if (attempt < static_cast<int>(slac::max_retries()) && g_pwr >= 0) {
            gpio_set_level(static_cast<gpio_num_t>(g_pwr), 0);
            slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
            gpio_set_level(static_cast<gpio_num_t>(g_pwr), 1);
            slac_delay(QCA7000_POWER_CYCLE_DELAY_MS);
        }
    }
    ESP_LOGE(PLC_TAG, "modem missing after %u setup attempts", static_cast<unsigned>(slac::max_retries()));
    return false;
}

void qca7000teardown() {
    if (g_spi) {
        // bus handle provided externally; nothing to teardown here
    }
#ifdef ESP_PLATFORM
    if (g_auto_irq && g_int >= 0)
        gpio_isr_handler_remove(static_cast<gpio_num_t>(g_int));
#endif
    head.store(0, std::memory_order_relaxed);
    tail.store(0, std::memory_order_relaxed);
    g_spi = nullptr;
}

bool qca7000ResetAndCheck() {
    return hardReset();
}

bool qca7000SoftReset() {
    return softReset();
}

bool qca7000LeaveAvln() {
    // Leaving the logical network is done by issuing a soft reset which
    // clears the modem state without toggling the CP line.
    g_slac_ctx.filter_active = false;
    memset(g_slac_ctx.matched_mac, 0, sizeof(g_slac_ctx.matched_mac));
    return qca7000SoftReset();
}

